<!DOCTYPE html><html lang="en"><head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
    <link href="/assets/prism.css" rel="stylesheet">
    <!-- <link rel="stylesheet" href="./node_modules/highlight.js/styles/default.css">
    <link rel="stylesheet" href="./node_modules/highlight.js/styles/solarized-light.css"> -->
</head>
<body>
    <!--模板引擎 arttemplate  -->
    <h1 id="&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</h1>
<p>&#x73B0;&#x5728;&#x7684;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x662F;&#x5F88;&#x5C40;&#x9650;&#x7684;&#xFF0C;&#x5176;&#x4E3B;&#x8981;&#x57FA;&#x4E8E;&#x6A21;&#x677F;&#x6280;&#x672F;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x6A21;&#x677F;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x4E3A;&#x7B80;&#x5355;&#x7684;&#x5185;&#x5BB9;&#x66FF;&#x6362;&#xFF0C;&#x6BD4;&#x5982;Hugo&#x5C31;&#x662F;&#x7B80;&#x5355;&#x5730;&#x4ECE;markdown&#x751F;&#x6210;&#x5185;&#x5BB9;html&#xFF0C;&#x7136;&#x540E;&#x63D2;&#x5165;&#x4E00;&#x4E2A;layout&#x6A21;&#x677F;&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x63D2;&#x5165;&#x7684;&#x8FD8;&#x6709;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x53C2;&#x6570;<br>&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x8FD9;&#x5DF2;&#x7ECF;&#x591F;&#x7B80;&#x5355;&#x7684;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x5C31;&#x662F;&#x628A;&#x5305;&#x62EC;&#x5185;&#x5BB9;&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x53C2;&#x6570;&#x5728;&#x5185;&#x7684;&#x4E00;&#x63FD;&#x5B50;&#x6570;&#x636E;&#x6254;&#x5230;&#x6A21;&#x677F;&#x91CC;&#xFF0C;&#x53EF;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5374;&#x751F;&#x751F;&#x5F04;&#x6210;&#x4E86;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x786E;&#x5B9E;&#x6709;Linux&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x8D2F;&#x98CE;&#x683C;  </p>
<h1 id="&#x95EE;&#x9898;">&#x95EE;&#x9898;</h1>
<p>&#x5982;&#x4ECA;&#x8FD9;&#x79CD;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;</p>
<ul>
<li>&#x4E0D;&#x65B9;&#x4FBF;&#x4F7F;&#x7528;js&#x548C;&#x5404;&#x79CD;&#x524D;&#x7AEF;&#x6280;&#x672F;
&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x9759;&#x6001;&#x6A21;&#x677F;&#x5339;&#x914D;&#x7684;&#x903B;&#x8F91;&#x548C;&#x666E;&#x901A;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x7684;&#x903B;&#x8F91;&#x4E0D;&#x517C;&#x5BB9;&#xFF0C;&#x5199;&#x8D77;&#x6765;&#x5F88;&#x522B;&#x626D;&#xFF0C;&#x5BF9;SPA webapp&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x662F;&#x4E3B;&#x52A8;&#x4ECE;&#x670D;&#x52A1;&#x7AEF;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x800C;&#x975E;&#x81EA;&#x5DF1;&#x88AB;&#x5F3A;&#x884C;&#x201C;&#x63D2;&#x5165;&#x201D;&#xFF0C;&#x8FDE;&#x63D2;&#x5165;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x77E5;&#x9053;</li>
<li>&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x91C7;&#x7528;&#x539F;&#x59CB;&#x7684;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x5F62;&#x5F0F;<br>&#x4E0D;&#x7BA1;&#x662F;json xml &#x8FD8;&#x662F;&#x65B0;&#x7684; yaml toml &#x90FD;&#x4E0D;&#x8FC7;&#x662F;&#x6362;&#x6C64;&#x4E0D;&#x6362;&#x836F;&#xFF0C;&#x7F16;&#x8F91;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x5199;&#x7EAF;&#x6587;&#x672C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x751A;&#x81F3;&#x6BCF;&#x4E2A;&#x4E3B;&#x9898;&#x53EF;&#x80FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;&#x4E5F;&#x5168;&#x90E8;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x4E14;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#x6765;&#x4FDD;&#x8BC1;&#x4E3B;&#x9898;&#x4E0E;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x7684;&#x5339;&#x914D;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x63D0;&#x793A;&#x6216;&#x9009;&#x9879;&#xFF0C;&#x5982;&#x540C;20&#x5E74;&#x524D;&#x7684;&#x8F6F;&#x4EF6;  </li>
<li>&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5BB9;&#x683C;&#x5F0F;&#x76F8;&#x5BF9;&#x56FA;&#x5B9A;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;markdown&#x8FD9;&#x7C7B;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF0C;&#x867D;&#x7136;&#x4E66;&#x5199;&#x65B9;&#x4FBF;&#x4F46;&#x6709;&#x4E9B;&#x64CD;&#x4F5C;&#x5F88;&#x4E0D;&#x65B9;&#x4FBF;&#xFF0C;&#x6BD4;&#x5982;&#x63D2;&#x5165;&#x56FE;&#x7247;&#xFF0C;&#x63D2;&#x5165;codepen&#x7684;&#x4EE3;&#x7801;&#x6846;&#xFF0C;&#x5BF9;&#x7279;&#x5B9A;&#x683C;&#x5F0F;&#x5185;&#x5BB9;&#x6CA1;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x7F16;&#x8F91;&#x5DE5;&#x5177;&#xFF0C;&#x4F7F;&#x5185;&#x5BB9;&#x521B;&#x4F5C;&#x53D7;&#x9650;</li>
<li>&#x540E;&#x7AEF;&#x4F18;&#x5148;&#x7684;&#x601D;&#x7EF4;&#xFF0C;hugo hexo&#x8FD9;&#x7C7B;&#x5DE5;&#x5177;&#x751F;&#x6210;&#x9759;&#x6001;&#x9875;&#x9762;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7AEF; MVC&#x7C7B;&#x6846;&#x67B6;&#x5408;&#x6210;&#x524D;&#x7AEF;&#x9875;&#x9762;&#x7684;&#x8FC7;&#x7A0B;&#x4E00;&#x81F4;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x628A;&#x4E00;&#x4E2A;MVC&#x7F51;&#x7AD9;&#x968F;&#x4FBF;&#x6539;&#x6539;&#x5C31;&#x53EF;&#x4EE5;&#x53D8;&#x6210;&#x9759;&#x6001;&#x535A;&#x5BA2;&#xFF0C;&#x53EA;&#x8981;&#x628A;&#x6570;&#x636E;&#x6765;&#x6E90;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x6539;&#x6210;markdown&#x548C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;  &#x4F46;&#x8FD9;&#x5C31;&#x7528;&#x4E0D;&#x5230;&#x73B0;&#x5728;&#x5148;&#x8FDB;&#x7684;&#x524D;&#x7AEF;&#x6280;&#x672F;&#xFF0C;&#x540C;&#x65F6;&#x670D;&#x52A1;&#x7AEF;&#x5408;&#x6210;&#x4F1A;&#x8BA9;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x589E;&#x52A0;&#xFF0C;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x6DF7;&#x4E71;&#xFF0C;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x57FA;&#x672C;&#x5F88;&#x96BE;&#x53C2;&#x4E0E;</li>
<li>&#x751F;&#x6210;&#x7684;&#x5185;&#x5BB9;&#x5728;&#x4E00;&#x4E2A;public&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x8981;&#x81EA;&#x5DF1;&#x53BB;public&#x76EE;&#x5F55;&#x63D0;&#x4EA4;&#xFF0C;hexo&#x6709;&#x547D;&#x4EE4;&#x63D0;&#x4EA4;&#x4E0D;&#x8FC7;&#x4E5F;&#x662F;&#x6362;&#x6C64;&#x4E0D;&#x6362;&#x836F;</li>
</ul>
<h1 id="&#x6539;&#x8FDB;&#x65B9;&#x6CD5;">&#x6539;&#x8FDB;&#x65B9;&#x6CD5;</h1>
<ol>
<li>&#x4ECE;&#x540E;&#x7AEF;&#x4F18;&#x5148;&#x6539;&#x6210;&#x524D;&#x7AEF;&#x4F18;&#x5148;&#xFF0C;&#x4E5F;&#x5373;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x7F51;&#x7AD9;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x81EA;&#x5DF1;&#x4F1A;&#x4ECE;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x5185;&#x5BB9;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x7A0B;&#x5E8F;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x6E90;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x9759;&#x6001;&#x5B58;&#x5728;&#x7684;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x6570;&#x636E;&#x548C;&#x5185;&#x5BB9;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x6574;&#x4E2A;&#x7F51;&#x7AD9;</li>
<li>&#x7A0B;&#x5E8F;&#x81EA;&#x5E26;&#x547D;&#x4EE4;&#x63D0;&#x4EA4;&#x5230;&#x8FDC;&#x7AEF;&#xFF0C;&#x81EA;&#x5E26;&#x547D;&#x4EE4;&#x914D;&#x7F6E;&#x8FDC;&#x7AEF;&#xFF0C;&#x540C;&#x65F6;&#x4E0D;&#x628A;&#x751F;&#x6210;&#x7684;&#x653E;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x800C;&#x662F;&#x8BA9;theme&#x5C31;&#x4F5C;&#x4E3A;&#x4E3B;&#x9898;&#xFF0C;theme&#x4E0D;&#x518D;&#x662F;theme&#x800C;&#x662F;<strong>&#x6A21;&#x677F;&#x7F51;&#x7AD9;</strong>&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x4ECE;&#x6570;&#x636E;&#x6E90;&#x751F;&#x6210;&#x5185;&#x5BB9;&#x5E76;&#x653E;&#x5165;&#x9009;&#x5B9A;template site&#x7684;content&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x4EE5;json&#x5B58;&#x50A8;&#x53C2;&#x6570;,html&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x524D;&#x7AEF;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;json&#x548C;html&#x6765;&#x663E;&#x793A;&#x7F51;&#x7AD9;</li>
<li>&#x4F7F;&#x7528;&#x81EA;&#x63CF;&#x8FF0;&#x7684;&#xFF0C;&#x81EA;&#x5E26;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF08;&#x6216;&#x8005;&#x8BF4;&#x81EA;&#x5E26;&#x63CF;&#x8FF0;&#x811A;&#x672C;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x8BA9;&#x7F16;&#x8F91;&#x914D;&#x7F6E;&#x81EA;&#x5E26;GUI&#xFF0C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x9700;&#x8981;&#x53EF;&#x8054;&#x5408;&#x5373;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x811A;&#x672C;&#x53EF;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x5E76;&#x66F4;&#x65B0;&#x5176;&#x5185;&#x5BB9;&#xFF08;&#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x4E13;&#x7528;&#x7684;&#x201C;&#x7EDF;&#x4E00;&#x5185;&#x5BB9;&#x4E66;&#x5199;&#x7528;&#x683C;&#x5F0F;&#x201D;&#xFF0C;&#x4EE5;&#x53CA;&#x201C;&#x7EDF;&#x4E00;&#x5185;&#x5BB9;&#x8868;&#x793A;&#x8BED;&#x8A00;&#x201D;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x9610;&#x8FF0;</li>
<li>&#x53EF;&#x62D4;&#x63D2;&#x7684;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x8005;&#xFF0C;&#x4E5F;&#x5373;&#x5141;&#x8BB8;&#x5404;&#x79CD;Adapter&#x6765;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#xFF0C;&#x751A;&#x81F3;&#x5141;&#x8BB8;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#xFF0C;&#x8BA9;&#x4E66;&#x5199;&#x5185;&#x5BB9;&#x4E0D;&#x5C40;&#x9650;&#x4E8E;&#x4E00;&#x79CD;</li>
<li>&#x7EDF;&#x4E00;&#x4E2D;&#x95F4;&#x5185;&#x5BB9;&#x8868;&#x793A;&#xFF0C;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x8005;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x5230;&#x4E2D;&#x95F4;&#x8868;&#x793A;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x4E2D;&#x95F4;&#x8868;&#x793A;&#x751F;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x65B9;&#x4FBF;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x8005;&#x4E4B;&#x95F4;&#x8FC1;&#x79FB;  </li>
</ol>
<hr>
<p>&#x9664;&#x4E86;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x4E0D;&#x5B8C;&#x5584;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x6CA1;&#x6709;&#x901A;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x7BB1;&#x7CFB;&#x7EDF;&#xFF0C;&#x7B49;&#x56E0;&#x6B64;&#x8FD9;&#x91CC;&#x5217;&#x4E00;&#x4E2A;&#x8868;&#xFF1A;</p>
<ol>
<li>&#x81EA;&#x5E26;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x63CF;&#x8FF0;&#x548C;&#x7F16;&#x8F91;&#x811A;&#x672C;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x683C;&#x5F0F;</li>
<li>&#x4E13;&#x7528;&#x4E8E;&#x5199;&#x6587;&#x7AE0;&#x7684;<strong>&#x7EDF;&#x4E00;&#x5185;&#x5BB9;&#x8868;&#x793A;&#x683C;&#x5F0F;</strong>&#x4E0E;<strong>&#x7EDF;&#x4E00;&#x5185;&#x5BB9;&#x4E2D;&#x95F4;&#x8BED;&#x8A00;</strong>&#xFF08;&#x6709;&#x53EF;&#x80FD;&#x4E3A;&#x540C;&#x4E00;&#x79CD;&#xFF09;</li>
<li>&#x5E26;&#x6709;<ul>
<li>&#x5165;&#x53E3;</li>
<li>&#x89E6;&#x53D1;&#x5668;</li>
<li>&#x83DC;&#x5355;&#x7CFB;&#x7EDF;</li>
<li>&#x63D2;&#x4EF6;&#x4E0E;&#x9002;&#x914D;&#x5668;</li>
<li>&#x5E02;&#x573A;
&#x7684;&#x5C0F;&#x5DE5;&#x5177;&#x5E73;&#x53F0;&#xFF0C;Plugin&#x53EF;&#x81EA;&#x5DF1;&#x63CF;&#x8FF0;&#x81EA;&#x5DF1;&#x6709;&#x54EA;&#x4E9B;&#x83DC;&#x5355;&#x9879;&#xFF08;&#x9012;&#x5F52;&#xFF09;&#xFF0C;&#x80FD;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x542F;&#x52A8;&#xFF08;&#x5165;&#x53E3;&#xFF09;&#xFF0C;&#x76D1;&#x542C;&#x54EA;&#x4E9B;&#x4E8B;&#x4EF6;&#xFF08;&#x89E6;&#x53D1;&#x5668;&#xFF09;&#x7B49;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E73;&#x53F0;&#x7279;&#x522B;&#x9002;&#x5408;&#x90E8;&#x7F72;&#x4E00;&#x7EC4;&#x53EF;&#x4EE5;&#x6253;&#x5F00;&#x5404;&#x79CD;&#x6587;&#x4EF6;&#x7684;&#x5DE5;&#x5177;  </li>
</ul>
</li>
</ol>
<hr>

    
 

</body></html>